In [123]:
import numpy as np
import pandas as pd
import matplotlib

In [124]:
# Series

list1 = [4,3,6,8,7]
s1 = pd.Series(list1)
# s1 = pd.Series(list1, index =['a','b','c','d','e'])
print('s1 : \n', s1)
type(s1)
s1.dtype
s1.values
s1.index=['a','b','c','d','e']
# s1.index

s1 :
 0    4
1    3
2    6
3    8
4    7
dtype: int64

In [125]:
sdata={'kim' : 80, 'lee':85, 'choi':85}
s2 = pd.Series(sdata)
s2

kim     80
lee     85
choi    85
dtype: int64

In [126]:
# DataFrame

# DataFrame : 생성
# 형식: pd.DataFrame(data, columns=[], index=[])

# dictionary 데이터 활용
data = {'names':['민준', '현우', '서연', '동현', '지현'],
        'years':[2013, 2014, 2015, 2016, 2015],
        'points':[1.5, 1.7, 3.6, 2.4, 2.9]
        }
df = pd.DataFrame(data)

# print(df)와 df 출력방식이 서로 다름
print(df)
df

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2015     3.6
3    동현   2016     2.4
4    지현   2015     2.9

  names  years  points
0    민준   2013     1.5
1    현우   2014     1.7
2    서연   2015     3.6
3    동현   2016     2.4
4    지현   2015     2.9

In [127]:
names=['민준', '현우', '서연', '동현', '지현']
years=[2013, 2014, 2015, 2016, 2015]
points=[1.5, 1.7, 3.6, 2.4, 2.9]
data1 = [names, years, points]
data1
# -> 데이터가 3행 5열로 나옴 -> T(transpose)를 사용하여 행/열 반전시킴

[['민준', '현우', '서연', '동현', '지현'],
 [2013, 2014, 2015, 2016, 2015],
 [1.5, 1.7, 3.6, 2.4, 2.9]]

In [128]:
# 2차원 배열 데이터 활용
data2 = [['민준', '현우', '서연', '동현', '지현'],
         [2013, 2014, 2015, 2016, 2015],
         [1.5, 1.7, 3.6, 2.4, 2.9]]
arr = np.array(data2).T
df1 = pd.DataFrame(arr)
df1.columns=['name', 'year', 'point']
df1.index=[1,2,3,4,5]
# df1 = pd.DataFrame(arr, columns=['name', 'year', 'point'], index=[1,2,3,4,5])
df1

  name  year point
1   민준  2013   1.5
2   현우  2014   1.7
3   서연  2015   3.6
4   동현  2016   2.4
5   지현  2015   2.9

In [129]:
print(df1)
print(df1.index)
print(df.index)
print(df1.values)
print(df1.columns)

  name  year point
1   민준  2013   1.5
2   현우  2014   1.7
3   서연  2015   3.6
4   동현  2016   2.4
5   지현  2015   2.9
Index([1, 2, 3, 4, 5], dtype='int64')
RangeIndex(start=0, stop=5, step=1)
[['민준' '2013' '1.5']
 ['현우' '2014' '1.7']
 ['서연' '2015' '3.6']
 ['동현' '2016' '2.4']
 ['지현' '2015' '2.9']]
Index(['name', 'year', 'point'], dtype='object')

In [130]:
df1.info()
# array로 만든 후 dataframe을 만들었기 때문에 dtype이 전부  object로 나옴
# array는 한가지 데이터 타입만 들어갈 수 있다

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   point   5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

In [131]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   5 non-null      object
 1   years   5 non-null      int64
 2   points  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 252.0+ bytes

In [132]:
# chocolate_rating.csv 가져오기
choco_df = pd.read_csv("data/chocolate_rating.csv", header=None)
# header=None : 헤더가 따로 없을 때 없다고 해줘야 함
# -> 아니면 1행이 헤더가 됨
df3 = choco_df.head() # 맨 위의 5개만
df4 = choco_df.tail() # 맨 아래의 5개만
df3.to_csv("data/df3.csv", index=False)
df4.to_csv("data/df4.csv", index=False)
# index=False : 저장할 때 인덱스는 저장 안 되도록

In [133]:
charac_df = pd.read_excel("data/characters.xlsx")
charac_df.to_excel("data/dftest.xlsx", index=False)
charac_df

   ID   이름  상징색    취미    특징
0   1  뽀로로  파랑색    낚시    펭귄
1   2   에디  주황색  과학실험  사막여우
2   3   크롱  초록색   눈싸움    공룡
3   4   루피  분홍색    요리    비버
4   5   패티  보라색    운동    펭귄

In [134]:
charac_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   이름      5 non-null      object
 2   상징색     5 non-null      object
 3   취미      5 non-null      object
 4   특징      5 non-null      object
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [135]:
charac_df2 = pd.read_excel("data/dftest.xlsx")
charac_df2

   ID   이름  상징색    취미    특징
0   1  뽀로로  파랑색    낚시    펭귄
1   2   에디  주황색  과학실험  사막여우
2   3   크롱  초록색   눈싸움    공룡
3   4   루피  분홍색    요리    비버
4   5   패티  보라색    운동    펭귄

In [136]:
charac_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   이름      5 non-null      object
 2   상징색     5 non-null      object
 3   취미      5 non-null      object
 4   특징      5 non-null      object
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [137]:
choco_df

         0     1     2     3
0        1  2016  0.63  3.75
1        2  2015  0.70  2.75
2        3  2015  0.70  3.00
3        4  2015  0.70  3.50
4        5  2015  0.70  3.50
...    ...   ...   ...   ...
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

[1795 rows x 4 columns]

In [138]:
# DataFrame : 조회

# choco_df columns 지정해주기
choco_df.columns=['번호', '연도', '함유량', '평점']
choco_df

        번호    연도   함유량    평점
0        1  2016  0.63  3.75
1        2  2015  0.70  2.75
2        3  2015  0.70  3.00
3        4  2015  0.70  3.50
4        5  2015  0.70  3.50
...    ...   ...   ...   ...
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

[1795 rows x 4 columns]

In [139]:
# DataFrame 정보 보기

choco_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1795 entries, 0 to 1794
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      1795 non-null   int64
 1   연도      1795 non-null   int64
 2   함유량     1795 non-null   float64
 3   평점      1795 non-null   float64
dtypes: float64(2), int64(2)
memory usage: 56.2 KB

In [140]:
# 데이터 보기

# head() : 앞부분 데이터 5개 보기
print(choco_df.head())
# tail() : 뒷부분 데이터 5개 보기
print(choco_df.tail())

   번호    연도   함유량    평점
0   1  2016  0.63  3.75
1   2  2015  0.70  2.75
2   3  2015  0.70  3.00
3   4  2015  0.70  3.50
4   5  2015  0.70  3.50
        번호    연도   함유량    평점
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

In [141]:
# 인덱스 0~9까지 데이터 보기
print(choco_df[:10])
# 인덱스 10~19까지 데이터 보기
print(choco_df[10:20])

   번호    연도   함유량    평점
0   1  2016  0.63  3.75
1   2  2015  0.70  2.75
2   3  2015  0.70  3.00
3   4  2015  0.70  3.50
4   5  2015  0.70  3.50
5   6  2014  0.70  2.75
6   7  2014  0.70  3.50
7   8  2014  0.70  3.50
8   9  2014  0.70  3.75
9  10  2014  0.70  4.00
    번호    연도  함유량    평점
10  11  2013  0.7  2.75
11  12  2013  0.7  3.00
12  13  2013  0.7  3.25
13  14  2013  0.7  3.75
14  15  2013  0.7  2.75
15  16  2013  0.7  3.00
16  17  2013  0.7  3.25
17  18  2013  0.7  4.00
18  19  2013  0.7  3.25
19  20  2013  0.7  3.50

In [142]:
# 열 이름, 인덱스 조회

# 열 이름 조회
print(choco_df.columns)

# index
print(choco_df.index)

Index(['번호', '연도', '함유량', '평점'], dtype='object')
RangeIndex(start=0, stop=1795, step=1)

In [143]:
# describe() 함수 : 데이터 요약 정보를 보여줌

choco_df.describe()

                번호           연도          함유량           평점
count  1795.000000  1795.000000  1795.000000  1795.000000
mean    898.000000  2012.325348     0.717003     3.185933
std     518.316184     2.927210     0.063230     0.478062
min       1.000000  2006.000000     0.420000     1.000000
25%     449.500000  2010.000000     0.700000     2.875000
50%     898.000000  2013.000000     0.700000     3.250000
75%    1346.500000  2015.000000     0.750000     3.500000
max    1795.000000  2017.000000     1.000000     5.000000

In [144]:
# 인덱스 기준 정렬
# ascending : True(오름차순), False(내림차순)
df1.sort_index(axis=0, ascending=True)

# 열 기준 정렬
df1.sort_values(by=['point'], ascending=False)

  name  year point
3   서연  2015   3.6
5   지현  2015   2.9
4   동현  2016   2.4
2   현우  2014   1.7
1   민준  2013   1.5

In [145]:
# 데이터 조회
# 형식 :
# 1. 데이터프레임[조건식] : 시리즈로 출력하기
name = df1['name']
print('df1[\'name\'] : \n', name)
print('type(name) : ',type(name))
# or
print('df1.name : \n', df1.name)

df1['name'] :
 1    민준
2    현우
3    서연
4    동현
5    지현
Name: name, dtype: object
type(name) :  <class 'pandas.core.series.Series'>
df1.name :
 1    민준
2    현우
3    서연
4    동현
5    지현
Name: name, dtype: object

In [146]:
# 2. 데이터프레임[[조건식]] : 데이터프레임으로 출력하기
field = df1[['name', 'year']]
print('df1[[\'name\', \'year\']] : \n', field)
print('type(field) : ', type(field))
# or
print('df1[[\'name\', \'year\']] : \n', df1[['name', 'year']])

df1[['name', 'year']] :
   name  year
1   민준  2013
2   현우  2014
3   서연  2015
4   동현  2016
5   지현  2015
type(field) :  <class 'pandas.core.frame.DataFrame'>
df1[['name', 'year']] :
   name  year
1   민준  2013
2   현우  2014
3   서연  2015
4   동현  2016
5   지현  2015

In [147]:
# iloc : 행열의 인덱스로 데이터 조회
# 데이터프레임.iloc[행 인덱스, 열 인덱스]
print(df.iloc[0:3, 0:1])
print(df.iloc[0:4, [0,2]])
df1.iloc[::2, :2]

  names
0    민준
1    현우
2    서연
  names  points
0    민준     1.5
1    현우     1.7
2    서연     3.6
3    동현     2.4

  name  year
1   민준  2013
3   서연  2015
5   지현  2015

In [148]:
# loc : 행, 열 조회
# 데이터프레임.loc[행 조건, 열 조건]
print(df1.loc[1])
print(df1.loc[1:3]) # 인덱스 명을 직접 설정한다면 1~3까지 전부 나오게 됨
print(df1.loc[[1,3]])
print(df1.loc[1:4, ['name', 'point']])

name       민준
year     2013
point     1.5
Name: 1, dtype: object
  name  year point
1   민준  2013   1.5
2   현우  2014   1.7
3   서연  2015   3.6
  name  year point
1   민준  2013   1.5
3   서연  2015   3.6
  name point
1   민준   1.5
2   현우   1.7
3   서연   3.6
4   동현   2.4

In [149]:
# 조건 만족하는 데이터 조회
df1.point = df1.point.astype('Float64')
print(df1.info())
df1[df1.point>=2]
# 위의 첫 문장이 없으면 아래와 같은 오류가 뜸
# TypeError: '>=' not supported between instances of 'str' and 'int'
# object형이라 비교가 불가능
#  -> 형 변환 필요함 -> 첫번째 문장 추가

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   point   5 non-null      Float64
dtypes: Float64(1), object(2)
memory usage: 337.0+ bytes
None

  name  year  point
3   서연  2015    3.6
4   동현  2016    2.4
5   지현  2015    2.9

In [150]:
df1.year = df1.year.astype('Int64')
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      Int64
 2   point   5 non-null      Float64
dtypes: Float64(1), Int64(1), object(1)
memory usage: 342.0+ bytes

In [151]:
# 두 조건식 모두 만족(&)한 데이터 조회
df1.loc[(df1['year'] == 2015) & (df1.point >= 3), ['name', 'year']]
# & 또는 | 를 사용할 때 조건식들은 ()로 감싸주어야 함

  name  year
3   서연  2015

In [152]:
# 두 조건식 중 하나만족(|)한 데이터 조회
df1[(df1['year'] == 2014) | (df1.point >= 3)]

  name  year  point
2   현우  2014    1.7
3   서연  2015    3.6

In [153]:
# isin(): 일치하는 데이터 조회
df1[df1.name.isin(['민준', '현우'])]

  name  year  point
1   민준  2013    1.5
2   현우  2014    1.7

In [154]:
# 특정 문자열이 포함된 데이터 조회
df1[df1.name.str.contains('현')]

  name  year  point
2   현우  2014    1.7
4   동현  2016    2.4
5   지현  2015    2.9

In [155]:
# 데이터프레임 수정
# 데이터 수정
# 모든 행의 point 컬럼값 수정
df1.point = df1.point + 0.5
df1

  name  year  point
1   민준  2013    2.0
2   현우  2014    2.2
3   서연  2015    4.1
4   동현  2016    2.9
5   지현  2015    3.4

In [156]:
df1.loc[df1.name == '현우', 'point'] = df1.loc[df1.name == '현우', 'point'] + 1
df1

  name  year  point
1   민준  2013    2.0
2   현우  2014    3.2
3   서연  2015    4.1
4   동현  2016    2.9
5   지현  2015    3.4

In [157]:
# 특정 행의 point 컬럼값 수정
df1.loc[1, 'point'] = df1.loc[1, 'point'] + 1
df1

  name  year  point
1   민준  2013    3.0
2   현우  2014    3.2
3   서연  2015    4.1
4   동현  2016    2.9
5   지현  2015    3.4

In [158]:
# 반복 연산자 사용
df1.loc[2:3, 'point'] = [0]*2
df1

  name  year  point
1   민준  2013    3.0
2   현우  2014    0.0
3   서연  2015    0.0
4   동현  2016    2.9
5   지현  2015    3.4

In [159]:
# 여러 개 값 수정
df1.loc[2:3, 'point'] = [2.7, 4.6]
df1

  name  year  point
1   민준  2013    3.0
2   현우  2014    2.7
3   서연  2015    4.6
4   동현  2016    2.9
5   지현  2015    3.4

In [160]:
# 데이터프레임 구조 변경
# 인덱스 변경
# name 컬럼을 인덱스로 설정
df1.set_index('name')
df1
# -> 안 바뀐 것처럼 보임

  name  year  point
1   민준  2013    3.0
2   현우  2014    2.7
3   서연  2015    4.6
4   동현  2016    2.9
5   지현  2015    3.4

In [161]:
# inplace=True 를 사용
df1.set_index('name', inplace=True)
df1

      year  point
name
민준    2013    3.0
현우    2014    2.7
서연    2015    4.6
동현    2016    2.9
지현    2015    3.4

In [163]:
# 인덱스 복구
df1.reset_index(inplace=True)
df1

  name  year  point
0   민준  2013    3.0
1   현우  2014    2.7
2   서연  2015    4.6
3   동현  2016    2.9
4   지현  2015    3.4

In [170]:
# 열 추가
df1['bonus'] = df1.point*0.5
df1['bonus1'] = 10
df1['bonus2'] = [1,2,3,4,5]
df1['bonus3'] = df1.point + df1.bonus
# df1['bonus3'] = [0.5, 0.2] -> 개수가 맞지 않아서 에러 발생함
df1

  name  year  point  bonus  bonus1  bonus2  bonus3
0   민준  2013    3.0    1.5      10       1     4.5
1   현우  2014    2.7   1.35      10       2    4.05
2   서연  2015    4.6    2.3      10       3     6.9
3   동현  2016    2.9   1.45      10       4    4.35
4   지현  2015    3.4    1.7      10       5     5.1

In [174]:
# 열 삭제 axis=1
df1.drop('bonus3', axis=1)
df1.drop('bonus3', axis=1, inplace=True)
df1.drop('bonus2', axis=1)
df1.drop('bonus2', axis=1, inplace=True)
df1

  name  year  point  bonus  bonus1
0   민준  2013    3.0    1.5      10
1   현우  2014    2.7   1.35      10
2   서연  2015    4.6    2.3      10
3   동현  2016    2.9   1.45      10
4   지현  2015    3.4    1.7      10

In [175]:
# 데이터 치환
df1['gender'] = ['male', 'male', 'female', 'male', 'female']
df1

  name  year  point  bonus  bonus1  gender
0   민준  2013    3.0    1.5      10    male
1   현우  2014    2.7   1.35      10    male
2   서연  2015    4.6    2.3      10  female
3   동현  2016    2.9   1.45      10    male
4   지현  2015    3.4    1.7      10  female

In [177]:
rep_cond = {'gender':{'male':1, 'female':2}}
df2 = df1.replace(rep_cond)
df2

C:\Users\it\AppData\Local\Temp\ipykernel_18704\1745255518.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df2 = df1.replace(rep_cond)

  name  year  point  bonus  bonus1  gender
0   민준  2013    3.0    1.5      10       1
1   현우  2014    2.7   1.35      10       1
2   서연  2015    4.6    2.3      10       2
3   동현  2016    2.9   1.45      10       1
4   지현  2015    3.4    1.7      10       2

In [183]:
# 데이터프레임 연산
print(df1.describe())
print('\n')
print(df1.year.value_counts)
print('\n')
print(df1.groupby('gender')['point'].sum())
print('\n')
print(df1.groupby('gender')[['point', 'bonus', 'bonus1']].mean())

           year     point     bonus  bonus1
count       5.0       5.0       5.0     5.0
mean     2014.6      3.32      1.66    10.0
std    1.140175  0.759605  0.379803     0.0
min      2013.0       2.7      1.35    10.0
25%      2014.0       2.9      1.45    10.0
50%      2015.0       3.0       1.5    10.0
75%      2015.0       3.4       1.7    10.0
max      2016.0       4.6       2.3    10.0


<bound method IndexOpsMixin.value_counts of 0    2013
1    2014
2    2015
3    2016
4    2015
Name: year, dtype: Int64>


gender
female    8.0
male      8.6
Name: point, dtype: Float64


           point     bonus  bonus1
gender
female       4.0       2.0    10.0
male    2.866667  1.433333    10.0

In [184]:
print(df1.groupby(['year','gender'])['point'].median())
print('\n')
print(df1.groupby('gender')['point'].agg(['sum', 'mean', 'count']))
print('\n')
print(df1.groupby('gender').agg({'point':'count', 'bonus': 'mean', 'bonus1':'sum'}))

year  gender
2013  male      3.0
2014  male      2.7
2015  female    4.0
2016  male      2.9
Name: point, dtype: Float64


        sum      mean  count
gender
female  8.0       4.0      2
male    8.6  2.866667      3


        point     bonus  bonus1
gender
female      2       2.0      20
male        3  1.433333      30